<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.145">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26"/>
  <Typedef id="_2" name="__int128_t" type="_27" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_28" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_29" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_30" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_31" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="AreaUnits" context="_1" location="f1:31" file="f1" line="31" members="_32 _33 _34 _35 _36 _37 _38" size="8" align="8"/>
  <Struct id="_8" name="BasalAreaUnits" context="_1" location="f1:47" file="f1" line="47" members="_39 _40 _41 _42 _43 _44 _45" size="8" align="8"/>
  <Struct id="_9" name="LengthUnits" context="_1" location="f1:59" file="f1" line="59" members="_46 _47 _48 _49 _50 _51 _52" size="8" align="8"/>
  <Struct id="_10" name="LoadingUnits" context="_1" location="f1:77" file="f1" line="77" members="_53 _54 _55 _56 _57 _58 _59" size="8" align="8"/>
  <Struct id="_11" name="SurfaceAreaToVolumeUnits" context="_1" location="f1:91" file="f1" line="91" members="_60 _61 _62 _63 _64 _65 _66" size="8" align="8"/>

    <Argument type="_211" location="f1:243" file="f1" line="243"/>
  </OperatorMethod>
  <Destructor id="_150" name="HeatSourceAndReactionIntensityUnits" context="_23" access="public" location="f1:243" file="f1" line="243" inline="1" artificial="1"/>
  <Enumeration id="_151" name="FirelineIntensityUnitsEnum" context="_24" access="public" location="f1:260" file="f1" line="260" size="32" align="32">
    <EnumValue name="BtusPerFootPerSecond" init="0"/>
    <EnumValue name="BtusPerFootPerMinute" init="1"/>
    <EnumValue name="KilojoulesPerMeterPerSecond" init="2"/>
    <EnumValue name="KilojoulesPerMeterPerMinute" init="3"/>
    <EnumValue name="KilowattsPerMeter" init="4"/>
  </Enumeration>
  <Method id="_152" name="toBaseUnits" returns="_178" context="_24" access="public" location="f1:269" file="f1" line="269" static="1" mangled="_ZN22FirelineIntensityUnits11toBaseUnitsEdNS_26FirelineIntensityUnitsEnumE">
    <Argument name="value" type="_178" location="f1:269" file="f1" line="269"/>
    <Argument name="units" type="_151" location="f1:269" file="f1" line="269"/>
  </Method>
  <Method id="_153" name="fromBaseUnits" returns="_178" context="_24" access="public" location="f1:270" file="f1" line="270" static="1" mangled="_ZN22FirelineIntensityUnits13fromBaseUnitsEdNS_26FirelineIntensityUnitsEnumE">
    <Argument name="value" type="_178" location="f1:270" file="f1" line="270"/>
    <Argument name="units" type="_151" location="f1:270" file="f1" line="270"/>
  </Method>
  <Constructor id="_154" name="FirelineIntensityUnits" context="_24" access="public" location="f1:258" file="f1" line="258" inline="1" artificial="1"/>
  <Constructor id="_155" name="FirelineIntensityUnits" context="_24" access="public" location="f1:258" file="f1" line="258" inline="1" artificial="1">
    <Argument type="_213" location="f1:258" file="f1" line="258"/>
  </Constructor>
  <OperatorMethod id="_156" name="=" returns="_214" context="_24" access="public" location="f1:258" file="f1" line="258" inline="1" artificial="1" mangled="_ZN22FirelineIntensityUnitsaSERKS_">
    <Argument type="_213" location="f1:258" file="f1" line="258"/>
  </OperatorMethod>
  <Destructor id="_157" name="FirelineIntensityUnits" context="_24" access="public" location="f1:258" file="f1" line="258" inline="1" artificial="1"/>
  <Enumeration id="_158" name="TemperatureUnitsEnum" context="_25" access="public" location="f1:275" file="f1" line="275" size="32" align="32">
    <EnumValue name="Fahrenheit" init="0"/>
    <EnumValue name="Celsius" init="1"/>
    <EnumValue name="Kelvin" init="2"/>
  </Enumeration>
  <Method id="_159" name="toBaseUnits" returns="_178" context="_25" access="public" location="f1:282" file="f1" line="282" static="1" mangled="_ZN16TemperatureUnits11toBaseUnitsEdNS_20TemperatureUnitsEnumE">
    <Argument name="value" type="_178" location="f1:282" file="f1" line="282"/>
    <Argument name="units" type="_158" location="f1:282" file="f1" line="282"/>
  </Method>
  <Method id="_160" name="fromBaseUnits" returns="_178" context="_25" access="public" location="f1:283" file="f1" line="283" static="1" mangled="_ZN16TemperatureUnits13fromBaseUnitsEdNS_20TemperatureUnitsEnumE">
    <Argument name="value" type="_178" location="f1:283" file="f1" line="283"/>
    <Argument name="units" type="_158" location="f1:283" file="f1" line="283"/>
  </Method>
  <Constructor id="_161" name="TemperatureUnits" context="_25" access="public" location="f1:273" file="f1" line="273" inline="1" artificial="1"/>
  <Constructor id="_162" name="TemperatureUnits" context="_25" access="public" location="f1:273" file="f1" line="273" inline="1" artificial="1">
    <Argument type="_215" location="f1:273" file="f1" line="273"/>
  </Constructor>
  <OperatorMethod id="_163" name="=" returns="_216" context="_25" access="public" location="f1:273" file="f1" line="273" inline="1" artificial="1" mangled="_ZN16TemperatureUnitsaSERKS_">
    <Argument type="_215" location="f1:273" file="f1" line="273"/>
  </OperatorMethod>
  <Destructor id="_164" name="TemperatureUnits" context="_25" access="public" location="f1:273" file="f1" line="273" inline="1" artificial="1"/>
  <Enumeration id="_165" name="TimeUnitsEnum" context="_26" access="public" location="f1:288" file="f1" line="288" size="32" align="32">
    <EnumValue name="Minutes" init="0"/>
    <EnumValue name="Seconds" init="1"/>
    <EnumValue name="Hours" init="2"/>
    <EnumValue name="Days" init="3"/>
    <EnumValue name="Years" init="4"/>
  </Enumeration>
  <Method id="_166" name="toBaseUnits" returns="_178" context="_26" access="public" location="f1:297" file="f1" line="297" static="1" mangled="_ZN9TimeUnits11toBaseUnitsEdNS_13TimeUnitsEnumE">
    <Argument name="value" type="_178" location="f1:297" file="f1" line="297"/>
    <Argument name="units" type="_165" location="f1:297" file="f1" line="297"/>
  </Method>
  <Method id="_167" name="fromBaseUnits" returns="_178" context="_26" access="public" location="f1:298" file="f1" line="298" static="1" mangled="_ZN9TimeUnits13fromBaseUnitsEdNS_13TimeUnitsEnumE">
    <Argument name="value" type="_178" location="f1:298" file="f1" line="298"/>
    <Argument name="units" type="_165" location="f1:298" file="f1" line="298"/>
  </Method>
  <Constructor id="_168" name="TimeUnits" context="_26" access="public" location="f1:286" file="f1" line="286" inline="1" artificial="1"/>
  <Constructor id="_169" name="TimeUnits" context="_26" access="public" location="f1:286" file="f1" line="286" inline="1" artificial="1">
    <Argument type="_217" location="f1:286" file="f1" line="286"/>
  </Constructor>
  <OperatorMethod id="_170" name="=" returns="_218" context="_26" access="public" location="f1:286" file="f1" line="286" inline="1" artificial="1" mangled="_ZN9TimeUnitsaSERKS_">
    <Argument type="_217" location="f1:286" file="f1" line="286"/>
  </OperatorMethod>
  <Destructor id="_171" name="TimeUnits" context="_26" access="public" location="f1:286" file="f1" line="286" inline="1" artificial="1"/>
  <Field id="_172" name="isa" type="_219" context="_29" access="public" offset="0"/>
  <Field id="_173" name="flags" type="_220" context="_29" access="public" offset="64"/>
  <Field id="_174" name="str" type="_221" context="_29" access="public" offset="128"/>
  <Field id="_175" name="length" type="_222" context="_29" access="public" offset="192"/>
  <Struct id="_177" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_223 _224 _225 _226" size="192" align="64"/>
  <FundamentalType id="_178" name="double" size="64" align="64"/>
  <ReferenceType id="_179" type="_7c" size="64" align="64"/>
  <CvQualifiedType id="_7c" type="_7" const="1"/>
  <ReferenceType id="_180" type="_7" size="64" align="64"/>
  <ReferenceType id="_181" type="_8c" size="64" align="64"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <ReferenceType id="_182" type="_8" size="64" align="64"/>
  <ReferenceType id="_183" type="_9c" size="64" align="64"/>
  <CvQualifiedType id="_9c" type="_9" const="1"/>
  <ReferenceType id="_184" type="_9" size="64" align="64"/>
  <ReferenceType id="_185" type="_10c" size="64" align="64"/>
  <CvQualifiedType id="_10c" type="_10" const="1"/>
  <ReferenceType id="_186" type="_10" size="64" align="64"/>
  <ReferenceType id="_187" type="_11c" size="64" align="64"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <ReferenceType id="_188" type="_11" size="64" align="64"/>
  <ReferenceType id="_189" type="_12c" size="64" align="64"/>
  <CvQualifiedType id="_12c" type="_12" const="1"/>
  <ReferenceType id="_190" type="_12" size="64" align="64"/>
  <ReferenceType id="_191" type="_13c" size="64" align="64"/>
  <CvQualifiedType id="_13c" type="_13" const="1"/>
  <ReferenceType id="_192" type="_13" size="64" align="64"/>
  <ReferenceType id="_193" type="_14c" size="64" align="64"/>
  <CvQualifiedType id="_14c" type="_14" const="1"/>
  <ReferenceType id="_194" type="_14" size="64" align="64"/>
  <ReferenceType id="_195" type="_15c" size="64" align="64"/>
  <CvQualifiedType id="_15c" type="_15" const="1"/>
  <ReferenceType id="_196" type="_15" size="64" align="64"/>
  <ReferenceType id="_197" type="_16c" size="64" align="64"/>
  <CvQualifiedType id="_16c" type="_16" const="1"/>
  <ReferenceType id="_198" type="_16" size="64" align="64"/>
  <ReferenceType id="_199" type="_17c" size="64" align="64"/>
  <CvQualifiedType id="_17c" type="_17" const="1"/>
  <ReferenceType id="_200" type="_17" size="64" align="64"/>
  <ReferenceType id="_201" type="_18c" size="64" align="64"/>
  <CvQualifiedType id="_18c" type="_18" const="1"/>
  <ReferenceType id="_202" type="_18" size="64" align="64"/>
  <ReferenceType id="_203" type="_19c" size="64" align="64"/>
  <CvQualifiedType id="_19c" type="_19" const="1"/>
  <ReferenceType id="_204" type="_19" size="64" align="64"/>
  <ReferenceType id="_205" type="_20c" size="64" align="64"/>
  <CvQualifiedType id="_20c" type="_20" const="1"/>
  <ReferenceType id="_206" type="_20" size="64" align="64"/>
  <ReferenceType id="_207" type="_21c" size="64" align="64"/>
  <CvQualifiedType id="_21c" type="_21" const="1"/>
  <ReferenceType id="_208" type="_21" size="64" align="64"/>
  <ReferenceType id="_209" type="_22c" size="64" align="64"/>
  <CvQualifiedType id="_22c" type="_22" const="1"/>
  <ReferenceType id="_210" type="_22" size="64" align="64"/>
  <ReferenceType id="_211" type="_23c" size="64" align="64"/>
  <CvQualifiedType id="_23c" type="_23" const="1"/>
  <ReferenceType id="_212" type="_23" size="64" align="64"/>
  <ReferenceType id="_213" type="_24c" size="64" align="64"/>
  <CvQualifiedType id="_24c" type="_24" const="1"/>
  <ReferenceType id="_214" type="_24" size="64" align="64"/>
  <ReferenceType id="_215" type="_25c" size="64" align="64"/>
  <CvQualifiedType id="_25c" type="_25" const="1"/>
  <ReferenceType id="_216" type="_25" size="64" align="64"/>
  <ReferenceType id="_217" type="_26c" size="64" align="64"/>
  <CvQualifiedType id="_26c" type="_26" const="1"/>
  <ReferenceType id="_218" type="_26" size="64" align="64"/>
  <PointerType id="_219" type="_220c" size="64" align="64"/>
  <FundamentalType id="_220" name="int" size="32" align="32"/>
  <CvQualifiedType id="_220c" type="_220" const="1"/>
  <PointerType id="_221" type="_176c" size="64" align="64"/>
  <CvQualifiedType id="_176c" type="_176" const="1"/>
  <FundamentalType id="_222" name="long int" size="64" align="64"/>
  <Field id="_223" name="gp_offset" type="_227" context="_177" access="public" offset="0"/>
  <Field id="_224" name="fp_offset" type="_227" context="_177" access="public" offset="32"/>
  <Field id="_225" name="overflow_arg_area" type="_228" context="_177" access="public" offset="64"/>
  <Field id="_226" name="reg_save_area" type="_228" context="_177" access="public" offset="128"/>
  <FundamentalType id="_227" name="unsigned int" size="32" align="32"/>
  <PointerType id="_228" type="_229" size="64" align="64"/>
  <FundamentalType id="_176" name="char" size="8" align="8"/>
  <FundamentalType id="_229" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="behave/src/behave/behaveUnits.h"/>
</GCC_XML>
